2D_TestCase_2nucleation_sites/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     BoilingCondensationFOAM;

startFrom      latestTime; //startTime;// 
startTime       0;

stopAt          endTime;

endTime         1;

deltaT         1e-5;

//writeControl    adjustableRunTime;

writeInterval    200;

purgeWrite   0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           5.0;

maxAlphaCo      1.0;

maxDeltaT       1e-2;


// ************************************************************************* //
