2D_TestCase_2nucleation_sites/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.001;

vertices
(
    (0 0 0)     // 0
    (10 0 0)     // 1
    (10 10 0)     // 2
    (0 10 0)     // 3
    (0 0 0.1)     // 4
    (10 0 0.1)     // 5
    (10 10 0.1)     // 6
    (0 10 0.1)     // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (250 250 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }

    right
    {
        type wall;
        faces
        (
            (1 5 6 2)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    top
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }

    frontAndback
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);

