2D_TestCase_2nucleation_sites/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       124500;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       124750;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          230;
        startFace       125000;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       125230;
    }
    frontAndback
    {
        type            empty;
        inGroups        1(empty);
        nFaces          125000;
        startFace       125480;
    }
    bottom_nucleation
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       250480;
    }
)

// ************************************************************************* //
