2D_TestCase_2nucleation_sites/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  
    left
    {
        type        noSlip;
    }
    right
    {
        type        noSlip;
    }  
    "bottom.*"
    {
        type        noSlip;
    }  
    top
    {
        type        pressureInletOutletVelocity;
        value 	     $internalField;
    } 
    frontAndback
    {
        type        empty;
    }
  


}


// ************************************************************************* //
