2D_TestCase_2nucleation_sites/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField       uniform 1e5;

boundaryField
{
    left
    {
       type            calculated;
        value           $internalField;
    }
   

    right
    {
       type            calculated;
        value           $internalField;
    }
    

    bottom
    {
        type            calculated;
        value           $internalField;
    }
    top
    {
        type            calculated;
        value           $internalField;
    }
    frontAndback
    {
        type            empty;
        
    }
    
    
    bottom_nucleation
    {
        type            calculated;
        value           $internalField;
    }
}



// ************************************************************************* //
