2D_TestCase_2nucleation_sites/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 1 -1 -2 0 0 0 0 ];

//internalField       uniform 13.5e5;
internalField         uniform 1e5;

boundaryField
{
    left
    {
       type             fixedFluxPressure;
        value           $internalField;
    }
   

    right
    {
       type            fixedFluxPressure;
        value           $internalField;
    }
    

    bottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndback
    {
        type            empty;
        
    }
    
    bottom_nucleation
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
