2D_TestCase_2nucleation_sites/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 330.15;

boundaryField
{
    left
    {
        type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }
    
    top
    {
        type            fixedValue;
        value           uniform 328.15; 
    }
    
   frontAndback
    {
        type            empty;
        
    }
    
    "bottom.*"
    
      {
        type            fixedValue;
        value           uniform 335.15; 
    }
    
   /* {

       type               compressible::thermalBaffleTop;

        // Underlying coupled boundary condition
        Tnbr               T;
        kappaMethod        fluidThermo; // or solidThermo

        qrNbr              none;//or none.Name of qr field on neighbourregion
        qr                 none;// or none.Name of qr field on localregion
        value              uniform 391;

        // Baffle region name
        region              baffle3DRegion_bottom;
        active              yes;

        // The baffle is extruded from this patch to the patch 'bottom_heated'
        // of the solid region.
        internal            no;

        // Solid thermo in solid region
        thermoType
        {
            type            heSolidThermo;
            mixture         pureMixture;
            transport       constIso;
            thermo          hConst;
            equationOfState rhoConst;
            specie          specie;
            energy          sensibleEnthalpy;
        }

        mixture
        {
            specie
            {
                molWeight       63.546;
            }
            transport
            {
                kappa          398;
            }
            thermodynamics
            {
                Hf              0;
                Cp              385;
            }
            equationOfState
            {
                rho             8960;
            }
        }

        radiation
        {
            radiationModel  opaqueSolid;
            absorptionEmissionModel none;
            scatterModel    none;
        }

        // Extrude model for new region
        extrudeModel        linearNormal;
        nLayers             10;
        expansionRatio      1;
        columnCells         false; //3D
        linearNormalCoeffs
        {
            thickness           0.002;
        }
        
       
    }*/
    
  
}


// ************************************************************************* //
