2D_TestCase_2nucleation_sites/system/topoSetDict_old_2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    left_heated_wall;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.002 0 -1) (0.004 0.001 1);
            // Ensures only boundary faces are selected
            boundaryFacesOnly true;
        }
    }

    {
        name    right_heated_wall;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.006 0 -1) (0.008 0.001 1);
            boundaryFacesOnly true;
        }
    }
);
// ************************************************************************* //
