2D_TestCase_2nucleation_sites/system/topoSetDict_vapor_zone
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Region above left heated wall: x = 2–4 mm, y = 0–4 mm
    {
        name    boilingLeft;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.002 0 0) (0.004 0.004 0.001);
        }
    }

    // Region above right heated wall: x = 6–8 mm, y = 0–4 mm
    {
        name    boilingRight;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.006 0 0) (0.008 0.004 0.001);
        }
    }
);

// ************************************************************************* //
